content/index.org
#+title: Doom Emacs/Git
#+SETUPFILE: https://fniessen.github.io/org-html-themes/org/theme-readtheorg.setup
#+Title:  Klawiszologia
#+Author: xr5pl
#+macro: lastupdate (eval (format-time-string "%Y-%m-%d %H:%M"))


* Klawiszologia


|---------------------------------------+-------------+----------------------------------------------------|
| *WINDOWS*                             | Keys        | Opis                                               |
|---------------------------------------+-------------+----------------------------------------------------|
|                                       |             |                                                    |
| =other-window=                        | ~C-x o~     | /Select the next visible window/                   |
| =find-file-other-window=              | ~C-x 4 f~   | /Open a file in another window/                    |
| =dired-other-window=                  | ~C-x 4 d~   | /Open Dired in another window/                     |
| =dired-jump-other-window=             | ~C-x 4 j~   | /Open Dired in another window at location of file/ |
| =scroll-other-window=                 | ~M-pgdn~    | /Scroll the other window down without focusing it/ |
| =scroll-other-window-down=            | ~M-pgup~    | /Scroll the other window up without focusing it/   |
| =delete-window=                       | ~C-x 0~     | /Close the current window/                         |
| =delete-other-windows=                | ~C-x 1~     | /Close all other windows/                          |
| =split-window-below=                  | ~C-x 2~     | /Split the current window horizonally/             |
| =split-window-right=                  | ~C-x 3~     | /Split the current window vertically/              |
| =shrink-window-horizontally=          | ~C-x {~     | /Make the window smaller horizontally/             |
| =enlarge-window-horizontally=         | ~C-x }~     | /Make the window bigger horizontally/              |
| =shrink-window=                       | None!       | /Shrink the window vertically/                     |
| =shrink-window-if-larger-than-buffer= | ~C-x -~     | /Shrink the window vertically to buffer/           |
| =balance-windows=                     | ~C-x +~     | /Balance the sizes of all windows/                 |
|---------------------------------------+-------------+----------------------------------------------------|
| *Linki (zmienione)*                   | *Keys*      | *Opis*                                             |
|---------------------------------------+-------------+----------------------------------------------------|
| =org-insert-link=                     | ~SPC m l l~ | /Dodawanie lików do tekstu./                       |
|                                       |             |                                                    |
|---------------------------------------+-------------+----------------------------------------------------|
| Agenda/ToDo/Task/Journal              | Keys        | *Opis*                                             |
|---------------------------------------+-------------+----------------------------------------------------|
| =journal.org=                         | ~SPC n n j~ | /Wpis do dziennika.          /                     |
|                                       | ~SPC m t t~ | /Dopisujesz zadanie do TODO   /                    |
| TODO                                  | ~C-c C-t~   | /Robi nowe TODO                /                   |
| cykliczne wydarzenia                  | ~C-cxc~     | /wpisujesz ile ma być powtórzeń wydarzenia np. 3/  |
|                                       |             | /i jaki interwał np. +1w/                          |
|---------------------------------------+-------------+----------------------------------------------------|
| *Dired*                               | Keys        | *Opis*                                             |
|---------------------------------------+-------------+----------------------------------------------------|
| =dired-create-empty-file=             | ~SPC f f~   | /nowy plik/                                        |
| =dired-create-directory=              | ~+~         | /nowy katalog/                                     |
|                                       | ~d~         | /zaznaczasz do usunięcia.                   /      |
|                                       | ~x~         | /usuwasz.                                   /      |
|---------------------------------------+-------------+----------------------------------------------------|
| *Magit*                               | Keys        | *Opis*                                             |
|---------------------------------------+-------------+----------------------------------------------------|
| =magit-status=                        | ~SPC g g~   | /sprawdza status/                                  |
| =magit-clone=                         | ~SPC g C~   | /Clonowanie repozytorium/                          |
| =magit-file-stage=                    | ~SPC g S~   | /Stage wszystkie pliki/                            |
|                                       | ~c c~       | /commit/                                           |
|                                       | ~C-c C-c~   | /zatwierdzasz commita/                             |
|                                       | ~P p~       | /push/                                             |
|                                       | ~F r p~     | /pull rebase/                                      |
|                                       | ~q~         | /wyjscie/                                          |
|                                       |             |                                                    |
* Magit – Klawiszologia (PL / DE)

| Klawisz          | Opis (PL)                       | Beschreibung (DE)                     |
|------------------+---------------------------------+---------------------------------------|
| SPC g g          | Otwórz status repozytorium      | Repository-Status öffnen              |
| q                | Wyjście z Magit                 | Magit schließen                       |
|------------------+---------------------------------+---------------------------------------|
| s                | Stage plik / fragment           | Datei / Abschnitt „stagen“            |
| S                | Stage wszystkie pliki           | Alle Dateien „stagen“                 |
| u                | Cofnij stage (unstage)          | Datei aus „Staging“ entfernen         |
|------------------+---------------------------------+---------------------------------------|
| c c              | Nowy commit                     | Neuen Commit erstellen                |
| C-c C-c          | Zatwierdź commit                | Commit bestätigen                     |
| c a              | Popraw ostatni commit (amend)   | Letzten Commit ändern (Amend)         |
|------------------+---------------------------------+---------------------------------------|
| P p              | Push                            | Push                                  |
| P u              | Push + ustaw upstream           | Push + Upstream setzen                |
| P - f p          | Force push (po amend)           | Force Push (nach Amend)               |
|------------------+---------------------------------+---------------------------------------|
| F p              | Pull                            | Pull                                  |
| F r p            | Pull z rebase (zalecane)        | Pull mit Rebase (empfohlen)           |
|------------------+---------------------------------+---------------------------------------|
| TAB              | Rozwiń diff                     | Diff anzeigen / einklappen            |

* Links
*Informacja:* aktualizacja: {{{lastupdate}}}
