index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Doom Emacs (Nauka Git-a) Klawiszologia</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="https://cdn.simplecss.org/simple.min.css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Doom Emacs (Nauka Git-a) Klawiszologia</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org085136f">Klawiszologia</a></li>
<li><a href="#orgde4d5a9">Magit – Klawiszologia (PL / DE)</a></li>
<li><a href="#orgc4df5ee">Links</a></li>
</ul>
</div>
</div>


<div id="outline-container-org085136f" class="outline-2">
<h2 id="org085136f">Klawiszologia</h2>
<div class="outline-text-2" id="text-org085136f">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left"><b>WINDOWS</b></th>
<th scope="col" class="org-left">Keys</th>
<th scope="col" class="org-left">Opis</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><code>other-window</code></td>
<td class="org-left"><code>C-x o</code></td>
<td class="org-left"><i>Select the next visible window</i></td>
</tr>

<tr>
<td class="org-left"><code>find-file-other-window</code></td>
<td class="org-left"><code>C-x 4 f</code></td>
<td class="org-left"><i>Open a file in another window</i></td>
</tr>

<tr>
<td class="org-left"><code>dired-other-window</code></td>
<td class="org-left"><code>C-x 4 d</code></td>
<td class="org-left"><i>Open Dired in another window</i></td>
</tr>

<tr>
<td class="org-left"><code>dired-jump-other-window</code></td>
<td class="org-left"><code>C-x 4 j</code></td>
<td class="org-left"><i>Open Dired in another window at location of file</i></td>
</tr>

<tr>
<td class="org-left"><code>scroll-other-window</code></td>
<td class="org-left"><code>M-pgdn</code></td>
<td class="org-left"><i>Scroll the other window down without focusing it</i></td>
</tr>

<tr>
<td class="org-left"><code>scroll-other-window-down</code></td>
<td class="org-left"><code>M-pgup</code></td>
<td class="org-left"><i>Scroll the other window up without focusing it</i></td>
</tr>

<tr>
<td class="org-left"><code>delete-window</code></td>
<td class="org-left"><code>C-x 0</code></td>
<td class="org-left"><i>Close the current window</i></td>
</tr>

<tr>
<td class="org-left"><code>delete-other-windows</code></td>
<td class="org-left"><code>C-x 1</code></td>
<td class="org-left"><i>Close all other windows</i></td>
</tr>

<tr>
<td class="org-left"><code>split-window-below</code></td>
<td class="org-left"><code>C-x 2</code></td>
<td class="org-left"><i>Split the current window horizonally</i></td>
</tr>

<tr>
<td class="org-left"><code>split-window-right</code></td>
<td class="org-left"><code>C-x 3</code></td>
<td class="org-left"><i>Split the current window vertically</i></td>
</tr>

<tr>
<td class="org-left"><code>shrink-window-horizontally</code></td>
<td class="org-left"><code>C-x {</code></td>
<td class="org-left"><i>Make the window smaller horizontally</i></td>
</tr>

<tr>
<td class="org-left"><code>enlarge-window-horizontally</code></td>
<td class="org-left"><code>C-x }</code></td>
<td class="org-left"><i>Make the window bigger horizontally</i></td>
</tr>

<tr>
<td class="org-left"><code>shrink-window</code></td>
<td class="org-left">None!</td>
<td class="org-left"><i>Shrink the window vertically</i></td>
</tr>

<tr>
<td class="org-left"><code>shrink-window-if-larger-than-buffer</code></td>
<td class="org-left"><code>C-x -</code></td>
<td class="org-left"><i>Shrink the window vertically to buffer</i></td>
</tr>

<tr>
<td class="org-left"><code>balance-windows</code></td>
<td class="org-left"><code>C-x +</code></td>
<td class="org-left"><i>Balance the sizes of all windows</i></td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left"><b>Linki (zmienione)</b></td>
<td class="org-left"><b>Keys</b></td>
<td class="org-left"><b>Opis</b></td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left"><code>org-insert-link</code></td>
<td class="org-left"><code>SPC m l l</code></td>
<td class="org-left"><i>Dodawanie lików do tekstu.</i></td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">Agenda/ToDo/Task/Journal</td>
<td class="org-left">Keys</td>
<td class="org-left"><b>Opis</b></td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left"><code>journal.org</code></td>
<td class="org-left"><code>SPC n n j</code></td>
<td class="org-left">/Wpis do dziennika.          /</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left"><code>SPC m t t</code></td>
<td class="org-left">/Dopisujesz zadanie do TODO   /</td>
</tr>

<tr>
<td class="org-left">TODO</td>
<td class="org-left"><code>C-c C-t</code></td>
<td class="org-left">/Robi nowe TODO                /</td>
</tr>

<tr>
<td class="org-left">cykliczne wydarzenia</td>
<td class="org-left"><code>C-cxc</code></td>
<td class="org-left"><i>wpisujesz ile ma być powtórzeń wydarzenia np. 3</i></td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left"><i>i jaki interwał np. +1w</i></td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left"><b>Dired</b></td>
<td class="org-left">Keys</td>
<td class="org-left"><b>Opis</b></td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left"><code>dired-create-empty-file</code></td>
<td class="org-left"><code>SPC f f</code></td>
<td class="org-left"><i>nowy plik</i></td>
</tr>

<tr>
<td class="org-left"><code>dired-create-directory</code></td>
<td class="org-left"><code>+</code></td>
<td class="org-left"><i>nowy katalog</i></td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left"><code>d</code></td>
<td class="org-left">/zaznaczasz do usunięcia.                   /</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left"><code>x</code></td>
<td class="org-left">/usuwasz.                                   /</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left"><b>Magit</b></td>
<td class="org-left">Keys</td>
<td class="org-left"><b>Opis</b></td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left"><code>magit-status</code></td>
<td class="org-left"><code>SPC g g</code></td>
<td class="org-left"><i>sprawdza status</i></td>
</tr>

<tr>
<td class="org-left"><code>magit-clone</code></td>
<td class="org-left"><code>SPC g C</code></td>
<td class="org-left"><i>Clonowanie repozytorium</i></td>
</tr>

<tr>
<td class="org-left"><code>magit-file-stage</code></td>
<td class="org-left"><code>SPC g S</code></td>
<td class="org-left"><i>Stage wszystkie pliki</i></td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left"><code>c c</code></td>
<td class="org-left"><i>commit</i></td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left"><code>C-c C-c</code></td>
<td class="org-left"><i>zatwierdzasz commita</i></td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left"><code>P p</code></td>
<td class="org-left"><i>push</i></td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left"><code>F r p</code></td>
<td class="org-left"><i>pull rebase</i></td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left"><code>q</code></td>
<td class="org-left"><i>wyjscie</i></td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-orgde4d5a9" class="outline-2">
<h2 id="orgde4d5a9">Magit – Klawiszologia (PL / DE)</h2>
<div class="outline-text-2" id="text-orgde4d5a9">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Klawisz</th>
<th scope="col" class="org-left">Opis (PL)</th>
<th scope="col" class="org-left">Beschreibung (DE)</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">SPC g g</td>
<td class="org-left">Otwórz status repozytorium</td>
<td class="org-left">Repository-Status öffnen</td>
</tr>

<tr>
<td class="org-left">q</td>
<td class="org-left">Wyjście z Magit</td>
<td class="org-left">Magit schließen</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">s</td>
<td class="org-left">Stage plik / fragment</td>
<td class="org-left">Datei / Abschnitt „stagen“</td>
</tr>

<tr>
<td class="org-left">S</td>
<td class="org-left">Stage wszystkie pliki</td>
<td class="org-left">Alle Dateien „stagen“</td>
</tr>

<tr>
<td class="org-left">u</td>
<td class="org-left">Cofnij stage (unstage)</td>
<td class="org-left">Datei aus „Staging“ entfernen</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">c c</td>
<td class="org-left">Nowy commit</td>
<td class="org-left">Neuen Commit erstellen</td>
</tr>

<tr>
<td class="org-left">C-c C-c</td>
<td class="org-left">Zatwierdź commit</td>
<td class="org-left">Commit bestätigen</td>
</tr>

<tr>
<td class="org-left">c a</td>
<td class="org-left">Popraw ostatni commit (amend)</td>
<td class="org-left">Letzten Commit ändern (Amend)</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">P p</td>
<td class="org-left">Push</td>
<td class="org-left">Push</td>
</tr>

<tr>
<td class="org-left">P u</td>
<td class="org-left">Push + ustaw upstream</td>
<td class="org-left">Push + Upstream setzen</td>
</tr>

<tr>
<td class="org-left">P - f p</td>
<td class="org-left">Force push (po amend)</td>
<td class="org-left">Force Push (nach Amend)</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">F p</td>
<td class="org-left">Pull</td>
<td class="org-left">Pull</td>
</tr>

<tr>
<td class="org-left">F r p</td>
<td class="org-left">Pull z rebase (zalecane)</td>
<td class="org-left">Pull mit Rebase (empfohlen)</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">TAB</td>
<td class="org-left">Rozwiń diff</td>
<td class="org-left">Diff anzeigen / einklappen</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orgc4df5ee" class="outline-2">
<h2 id="orgc4df5ee">Links</h2>
<div class="outline-text-2" id="text-orgc4df5ee">
<p>
<b>Informacja:</b> aktualizacja: 2025-09-27 17:50
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.3 (<a href="https://orgmode.org">Org</a> mode 9.6.15)</p>
</div>
</body>
</html>
